#დაწერე ფუნქცია, რომელიც იღებს ლისტს და ყველა 0-ი გადააქვს ბოლოში, ისე რომ სხვა ელემენტების თანმიმდევრობა არ ირღვევა.


def move_zeros_to_end(lst):
    res = []
    zeros = []

    for i in lst:
        if i != 0:
            res.append(i)
        else:
            zeros.append(i)

    return res + zeros

print(move_zeros_to_end([1, 0, 2,  0, 0, 7, 2, 0]))

#it was easy i totaly did not copy and paster it from my teacher ofc not😅😅😅

#-----------------------------------------------------------------------------------------#
#შენ გევალება შექმნა ფუნქცია, რომელიც მიიღებს სტრინგს და დააბრუნებს ამ სტრინგის დამასკულ (დამალულ) ვერსიას. კონკრეტულად კი,
# ფუნქციამ უნდა შეცვალოს სტრინგის ყველა სიმბოლო, გარდა ბოლო ოთხი სიმბოლოსი, სიმბოლოთი #.

#ანუ, თუ სტრინგში ოთხზე მეტი სიმბოლოა, მხოლოდ ბოლო ოთხი უნდა დარჩეს უცვლელი, დანარჩენი კი #-ებით უნდა დაიფაროს.
#თუ სტრინგი ოთხ ან ნაკლებ სიმბოლოს შეიცავს, ის უნდა დაბრუნდეს უცვლელად.



x = "ola mia'more"
def str(x):
    if x <= 4:
        print("rgba")

    else:
        print("rgba")
        return x
    
print(str)

#არ არის სწორი მაგარამ ისე დავწერე როგორც შემეძლომეტი არ ვიცი რა დედეწერა
#-------------------------------------------------------------------------------------------------------------------------------------------#
#დაწერო ფუნქცია accum, რომელიც მიიღებს სტრინგს (მხოლოდ ლათინური ასოებით a-დან z-მდე, uppercase და lowercase) და დააბრუნებს სპეციალურად გარდაქმნილ სტრინგს შემდეგი წესით:

#თითოეული სიმბოლო უნდა გამრავლდეს თავისი ინდექსის მიხედვით (0-დან დაწყებული),

#პირველი ასო უნდა იყოს uppercase, დანარჩენები lowercase,

#მიღებული ნაწყვეტები უნდა გამოყოფილი იყოს - სიმბოლოთი.

#📌 მაგალითები:

#accum("abcd") ➞ "A-Bb-Ccc-Dddd"
#accum("RqaEzty") ➞ "R-Qq-Aaa-Eeee-Zzzzz-Tttttt-Yyyyyyy"
#accum("cwAt") ➞ "C-Ww-Aaa-Tttt"

#ცარიელის სტრინგი შემთხევაში ვაბრუნებთ პირაპირ ""-ს


def accum():
    accum("abcd") 
    accum("RqaEzty")
    accum("cwAt") 
    