# შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა სახელი და დაბეჭდავს მისთვის მიესალმებას (მაგალითად: "Hello ixvis tolma"). გამოძახეთ ეს ფუნქცია 2-ჯერ და გადაეცით სხვადასხვა სახელი


name = str(input("შეაიყვანე შენი სახელი:  "))
name1 = str(input("შეიყვანე მეორე სახელი:  "))
print("hello " +  name)
print("hello " +  name1)


#def-ი არ გამოვიყენე რადგან ის ვერ გავიგე თუ როგორ უნდა გავაკეთო
#str - ი input- ზე არ გვისწავლია მაგრამ მახსოვს რომ თვითონ str - ი ვისწავლეთ ვცადე და იმუშავა int - ზე კი არა