# შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვების სია, 
# გადაურეთ ორივეს for ციკლით და გაიგეთ თითოეულ სიაში რიცხვების ჯამი(შეინახეთ ცალკე ცვლადებში), 
# გაამრავლეთ ორივე ერთმანეთზე და დააბრუნეთ

#😎 შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია. გადაუარეთ ამ სიას while ციკლით და ჩაამატეთ გაორმაგებული რიცხვები ახალ სიაში. 
# საბოლოოდ დააბრუნეთ ეს სია
#ვერ მივხვდი რა გავაკეთო


list  = [1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10]
list1 = [1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10 , 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10]
for i in list,list1:
    print(list,list1)
def greet (list,list1):
    print()
    list3 = list + list1
    print(list3)
    list4 = list * list1
    print(list4)