#  1) თქვენი სიტყვებით ახსენით თუ რაში გვჭირდება ფუნქციების გამოყენება პითონში.✅
#  2) გადახედეთ რესურსს პითონში ფუნქციების შესახებ: https://www.w3schools.com/python/python_functions.asp✅
#  3) შექმენით ფუნქცია სახელწოდებით double_values რომელიც არგუმენტად მიიღებს სიას და დააბრუნებს ახალ სიას, სადაც თითოეული ელემენტი გაორმაგებული იქნება.
#  4) შექმენით ფუნქცია, რომელსაც არგუმენტად გადასცემთ სიას (ჩათვალეთ, რომ სიაში ინახება Integer-ი რიცხვები). ამ ფუნქციამ საბოლოოდ უნდა დააბრუნოს სიიდან მხოლოდ ლუწი რიცხვები.
#  5) შექმენით ფუნქცია და გადაეცით არგუმენტად სია. ფუნქციამ უნდა დააბრუნოს ახალი სია, რომლის თითოეული ელემენტიც უნდა იყოს კვადრატში აყვანილი.
#  6) შექმენით ფუნქცია და არგუმენტად გადაეცით String-ი. ფუნქციამ ეგრედწოდებულად უნდა "გაფილტროს" ეს სტრინგი თანხმოვანი ასოებისგან და მხოლოდ დააბრუნოს ის ხმოვანი ასოები, რომლებსაც ეს სტრინგი შეიცავს.
#  7) შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ფუნქციის მიზანი იქნება, რომ სიიდან დააბრუნოს მხოლოდ უარყოფითი რიცხვები.
#  8) წინა დავალების ანალოგიურად შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ამ შემთხვევაში ფუნქციის მიზანი იქნება, რომ სიიდან დააბრუნოს მხოლოდ დადებითი რიცხვები.
#  9) შექმენით ფუნქცია და მას პარამეტრად გადაეცით ერთი რიცხვი. ფუნქციამ უნდა დააბრუნოს ეს რიცხვი აყანილი კვადრატში და გამრავლებული 10-ზე. (ხარისხში აყვანის ოპერატორის შესახებ მოიძიეთ რესურსები, რათა გამოიყენოთ დავალებაში.)
#  10) შექმენით ფუნქცია. მას გადაეცით ორი პარამეტრი: x და y რიცხვები. ფუნქციამ უნდა დააბრუნოს x რიცხვი აყვანილი y ხარისხში.

#1)
#ფუნქციები გვჭირდება იმისთვის, რომ ერთი და იგივე კოდი ბევრჯერ არ დავწეროთ.
#ფუნქცია არის "კოდის ბლოკი", რომელსაც სახელს ვაძლევთ და შემდგომში როცა გვინდა მისი გამოყენება, უბრალოდ ფუნქციის გამოძახება გვყოფნის.
#ასე კოდი უფრო მარტივი, გასაგები და მრავალჯერად გამოყენებადია.

#--------------------------------------------------------------------------------------------------------------------#
#3)
def double_values(numbers):
    return [x * 2 for x in numbers]

print(double_values([1, 2, 3, 4]))  
#--------------------------------------------------------------------------------------------------------------------#
#4)
def get_even_numbers(numbers):
    return [x for x in numbers if x % 2 == 0]

print(get_even_numbers([1, 2, 3, 4, 5, 6]))  
#--------------------------------------------------------------------------------------------------------------------#
#5)
def square_values(numbers):
    return [x ** 2 for x in numbers]

print(square_values([1, 2, 3, 4]))  
#--------------------------------------------------------------------------------------------------------------------#
#6)

#--------------------------------------------------------------------------------------------------------------------#
#7)
def get_negative_numbers(numbers):
    return [x for x in numbers if x < 0]

print(get_negative_numbers([-5, -2, 0, 3, 7, -10]))  
#--------------------------------------------------------------------------------------------------------------------#
#8)
def get_positive_numbers(numbers):
    return [x for x in numbers if x > 0]

print(get_positive_numbers([-5, -2, 0, 3, 7, -10]))  
#--------------------------------------------------------------------------------------------------------------------#
#9)
def square_and_multiply(num):
    return (num ** 2) * 10

print(square_and_multiply(5))  
#--------------------------------------------------------------------------------------------------------------------#
#10)
def power(x, y):
    return x ** y

print(power(2, 3))  
print(power(5, 2))  