#ახსენი რა არის if else elife 


#-----------------------------------------------#
#                 if
#if ითარგმნება როგორც თუ
#if-ი გამოიყენება მაგ -->  
#[name] = int(input(ჩაწერე რამე რიცხვი:  ))
# if [name] ==/!=/<=/> 18
#   print("you are adult")
#-----------------------------------------------#
#               else
#else ითარგმნება როგორც თუ არ
#else იწერება ბოლოში და რაც არ უნდა ეწეროს იმას გამოიტანს რათქმაუნდა თუ ყველა if-ი არასწორია
#----------------------------------------------#
#                  elif
#elif-ი არის იგივე ფუნქცია რაც if-ი მაგრამ ამის დაწერა ბევრჯერ შეგვიძლია