#კომენტარების სახით ახსენი snake_case და camelCase

# ეს არის ცვლადი snake_case სტილით:
# სიტყვებს შორის გამყოფად გამოიყენება ქვედა ტირე (_) — ეს სტილი ხშირად გამოიყენება Python-ში
mosaxleobis_asaki = 25

# ეს არის ცვლადი camelCase სტილით:
# პირველი სიტყვა პატარა ასოთია, ხოლო მომდევნო სიტყვები იწყება დიდი ასოთი — ეს სტილი ხშირად გამოიყენება JavaScript-ში და სხვა ენებში
mosaxleobisAsaki = 25

# Python-ში რეკომენდებულია ცვლადებისა და ფუნქციებისთვის გამოიყენოთ snake_case
# მაგალითად:
piradi_weli = int(input("შეიყვანე შენი ასაკი: "))
aqtiuri_weli = int(input("შეიყვანე მიმდინარე წელი: "))

print("10 წელში გექნება", piradi_weli + 10, "წელი და იქნება", aqtiuri_weli + 10, "წელი.")
