#boss level:მომხარებელს შემოატანიენ თავისი ასაკი და რომელ წელშიც ცხოვრობს, და დაუპრინტეთ 10 წელში რამდენი წლის იქნება და რომელი წელი იქნება მაშინ
# მომხმარებელს შეჰყავს თავისი ასაკი და მიმდინარე წელი
asaki = int(input("შეიყვანე შენი ასაკი: "))            # input-ით ვიღებთ ასაკს და ვაქცევთ რიცხვად
weli = int(input("შეიყვანე რომელი წელია ახლა: "))      # input-ით ვიღებთ წელს და ვაქცევთ რიცხვად

# ვგებულობთ შედეგს 10 წლის შემდეგ
asaki_10_welshi = asaki + 10
momavli_weli = weli + 10

# ვბეჭდავთ პასუხს
print("10 წელში შენ იქნები", asaki_10_welshi, "წლის და მაშინ იქნება", momavli_weli, "წელი.")
