#1) ახსენით რა განსხვავებაა return-სა და print შორის

#2) ახსენით როგორ იქმნება def ფუნქცია

#3) ახსენით რას ნიშნავს keyword-ი, და ჩამოთავლეთ რამდენიმე

#4) გადახედეთ რესურსებს:
#https://www.w3schools.com/python/ref_func_list.asp (i am done)

#5) დახურეთ python ის sololearn: (i did it)
#----------------------------------------------return and print---------------------------------------------------------------#
#return -  ი რაღაცას აბრუნებს და გამოაქვს
#print - ით კი შეგვიძლია ეგრევე გამოვიტანოთ რაღაცა მაგ -->
print("Hello World")
#----------------------------------------------def function creation----------------------------------------------------------#
#არვიცი როგორ ავხსნა ამიტომაც უბრალოდ მარტივ მაგალითს გავაკეთებ -->
def greet(name):
    print("Hello,", name)
greet("Aleqsandre")
#----------------------------------------------keyword defenition-------------------------------------------------------------#
#Keyword (საკვანძო სიტყვა) არის სიტყვა, რომელსაც Python-ი იყენებს სპეციალური მნიშვნელობით.
#ის უკვე დაფიქსირებულია ენაში და ვერ გამოვიყენებთ ცვლადის სახელად.

#მაგალითად:

#if = 5   # ❌ შეცდომაა, რადგან "if" keyword-ია

# რამდენიმე keyword-ის მაგალითი:

#if – პირობებისთვის

#else – ალტერნატიული ბლოკი

#elif – დამატებითი პირობა

#for – ციკლისთვის

#while – გამეორებადი ციკლისთვის

#def – ფუნქციის შესაქმნელად

#return – ფუნქციიდან მნიშვნელობის დასაბრუნებლად

#True, False – ბულიონთა მნიშვნელობები

#None – ცარიელი მნიშვნელო
colors = ['red', 'blue', 'green', 'yellow', 'purple']
for color in colors:
  if 'r' in color:
    print(color)