# ახსენით რისთვის გამოიყენება len(), append(), insert(), pop().

# len() ბოდიშით ვერ გავიგე მაგრამ მაგალითი დავწერე
name = "aleqsandre"
print(len(name))


# append() ამ კოდი შესაძლებლობით შეგვიძლია რამე რიცხვიბოლოში დავამათ ან ჩანაწერი
numbers = [1 , 2 , 3 , 4 , 5 , 6]
numbers.append(10)
print(numbers)

# insert() -ის მეშვეონით შეგვიძლია რომელიმე ინდექსზე დავამატოთ რამე რიცხვი ან ნაწერი
numbers1 = [1 , 2 , 3 , 4 , 5 , 6]
numbers1.insert(3,"რავახარ ღრუტა😂")
print(numbers1)

# pop() -ის მეშვეობით შეგვიძლია რომ რამე რიცხვი ამოვშალოთ
#მაგ #1:
num = [1 , 2 , 3 , 4 , 5 , 6]
num.pop()
print(num)

#მაგ #2:
num1 = [1 , 2 , 3 , 4 , 5 , 6]
num1.pop(4)
print(num1)