#კომენტარებით ახსენით რაში გამოიყენება join და split ფუნქცია, და დაწერე join ზე და split ზე 1 მაგალითი მინიმუმ

#join - ი გამოიყენება რათა რახაცა ჩავამატოთ ჩვენს list - ში
#split - ი გამოიყენება რათა რაღაცა ამოვჭრათ list - იდან
#-----------------------------------------------------------------------------------------------------------------------#
#შექმენი ფუნქცია sum_two_number რომელიც იღებს 2 არგუმენტს a და b ს და აბრუნებს მათ ჯამს

def sum_two_number(a , b):
    sum = a + b
    return sum

sum_two_number(a,b(500,700))